Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 孟母看丈夫这样，也知道事情可能有些严重，联想刚刚丈夫接的电话，和之前这个少年说的，她脸色微微一变。
en_us: Seeing the way that her husband was acting, Meng Fei's mother knew that something severe had happened. At the thought of the call that her husband had just picked up and what Ye Feng just said, her expression changed a little.

source: 孟母阴沉道：“你一个小女娃家家的，怎么就这么恶毒！”
en_us: Meng Fei's mother exclaimed sullenly, "You're just a little girl, why are you so vicious!?"

source: 孟父听到她的声音，仿佛一下被惊醒了一般，惊恐的看向叶枫两兄妹，“你，你们是叶家什么人？”
en_us: When Meng Fei's father heard her voice, he seemed to have suddenly been awakened as he stared at Ye Feng and Ye Li in horror. "How are you two related to the Ye Family?"

source: 孟父咬了咬牙，回头看向叶漓，“可以，但是下跪，我来代替她！”这话一出，叶漓都不禁诧异的看了他一眼。
en_us: Meng Fei's father gritted his teeth and turned around to look at Ye Li. "Yes, but I'll kneel on her behalf!" After he said that, Ye Li couldn't help but look at him in surprise.

source: 孟父孟母直接给他这眼神吓得一个哆嗦，竟然是说不出话来了。
en_us: Meng Fei's parents was so frightened by his gaze that they shuddered, unable to say anything else.

source: 孟父孟母闻言，勃然大怒：“你还有理了不是，今儿个你要是不给我家非非下跪道歉，我们孟家决不罢休！”
en_us: Upon hearing her words, Meng Fei's parents suddenly flew into a rage and exclaimed, "So you think you're right, huh? If you don't kneel down and apologize to Meng Fei today, we won't let go of this matter!"

source: 孟父恼怒道：“你说我女儿欺负你，我怎么没看到你哪里受伤，倒是我女儿的手被你伤的这么严重，今天你不给我说清楚，别想走出这道门！”
en_us: Meng Fei's father hollered in exasperation, "You said my daughter bullied you, but why don't I see any injuries on you at all? You severely wounded my daughter's hand. Don't think of leaving before giving me a clear explanation today!"

source: 孟父愣了一下，随后脸僵了。
en_us: After being stunned for a while, Meng Fei's father's face stiffened.

source: 孟父提着的心一落，感激的看着她：“谢谢叶小姐，那我们公司。”
en_us: Feeling relieved, Meng Fei's father looked at her gratefully and said, "Thank you, Miss Ye Li. In this case, our company."

source: 孟父涨红了一张脸，想着自己刚刚在外人面前丢了那么大的面，也是不想再呆，告别一句就灰溜溜的带着妻女离开了。
en_us: Meng Fei's father's face became flushed again. Thinking about how much he had embarrassed himself just now, he didn't want to stay behind any longer either. After saying goodbye, he left ashamedly with his wife and daughter.

source: 孟父的脸一僵，伸手掏出了手机接通了电话，可电话中传来的内容，让这个男人脸色的怒容，逐渐转化成了惊骇和惶恐。
en_us: Meng Fei's father's face stiffened and he reached out to grab his mobile phone. He then answered the call but what he heard next made his anger turn into horror and panic.

source: 孟父的脸一僵，笑容几乎维持不下去。
en_us: Meng Fei's father's face stiffened and he almost couldn't keep up with the smiling.

source: 孟父脸上的笑容已经彻底绷不下去了。
en_us: The smile on Meng Fei's father's face had vanished.

source: 孟父说罢，见叶漓没有说话，涨红了脸，腿一曲就准备跪下去。
en_us: After saying that, Meng Fei's father's face became flushed and he bent his legs when he saw that Ye Li was remaining silent. He was all ready to kneel in front of her.

source: 孟父闻言，脸色一阵难看，却还是强撑着笑容，讨好之色溢于言表：“叶小姐，那你看这要怎么样才能原谅我们，赔偿多少钱什么的我们都能接受，只要你们不生气。”
en_us: Upon hearing her words, Meng Fei's father's face grew sullen but he still tried to keep a smile on his face. Trying to please Ye Li, he said, "Miss Ye, what must we do to get your forgiveness? We're willing to compensate you with any amount of money that you want, as long as it'll make you simmer down."

source: 孟非吓傻了。
en_us: Meng Fei was dumbfounded.

source: 孟非听到这话，顿时紧张的看了过来，这会儿她已经注意不到叶漓了，瞳孔中全是自己偶像的身影，掌心的痛都忘了个一干二净。
en_us: When Meng Fei heard that question, she immediately looked over nervously. At this moment, she could no longer pay any attention to Ye Li. All she could see was her idol and she had also forgotten about the pain in her palm.

source: 孟非噎住。
en_us: Meng Fei choked.

source: 孟非愣住了。
en_us: Meng Fei was dumbfounded.

source: 孟非是他唯一的孩子，从小娇宠长大没舍得动过一根手指头。
en_us: Meng Fei was his only child whom he had pampered ever since her birth. He had never laid a finger on her before.

source: 孟非是真的被刚刚那一幕吓傻了。
en_us: Meng Fei was truly dumbfounded by that scene.

source: 孟非更是瞪大了眼珠子，倒退了几步：“叶漓你什么意思，你竟敢让我给你下跪道歉？我看你是在做梦！”
en_us: Meng Fei's eyes widened in shock and she took a few steps back. "Ye Li, what do you mean? How dare you ask me to kneel down and apologize to you? You must be dreaming!"

source: 孟非的脸一僵。
en_us: Meng Fei's face stiffened.

source: 孟非的脸上带着不符合这个年纪的恶毒之色，闻言狠狠的瞪着叶漓道：“我要她下跪道歉，再赔偿我一百万的精神损失费！”
en_us: With a vicious expression that should not have appeared on the face of a girl her age, Meng Fei glowered at Ye Li and said, "I want her to kneel down and apologize, and then compensate me with a million yuan for the emotional damage that she has done to me!"

source: 孟非看到他这个表情，脸色都白了，疯狂的摇着头：“爸，爸爸你想干什么，我不要！”
en_us: Meng Fei turned pale when she saw his expression and she nodded hysterically. "Father, what are you trying to do? I don't want to do it!"

source: 孟非瞪着眼珠子，原本看着叶漓的脸色从嫌恶逐渐变得难以置信。
en_us: Meng Fei's eyes were wide open as she stared at Ye Li. The look of disgust on her face gradually turned into disbelief.

source: 孟非被她这眼神看的一阵心慌，赶忙去扯自家父亲的手臂，疯狂摇晃：“爸，我才不要，你快帮我啊！”
en_us: Panicking because the gaze in her eyes, Meng Fei hurriedly tugged her father's arm and shook it vigorously. "Father, I don't want that. Hurry and help me!"

source: 孟非蹙了蹙眉：“你什么意思？”
en_us: Meng Fei frowned and asked, "What do you mean?"

source: 学校里有钱人家的少爷小姐，都是比较出名的，可叶漓是靠自家妹妹出名的，也没传过她家有钱，所以大家并没有将叶漓放在心上。
en_us: The children of the wealthy families in school were all rather famous in school but Ye Li was only well known because of her sister. There were no rumors about her family being wealthy so no one took Ye Li seriously.

source: 完了完了，这个女的和叶眉从同一辆车上下来，那肯定也不是一般人。
en_us: 'Oh dear, it's over for us. This girl alighted from the same car as Ye Mei. She's definitely not an ordinary person.'

source: 客厅中，已经站了不少的宾客。
en_us: There were already numerous guests in the guest hall.

source: 家人群里，大家都看到了叶枫发的自己和妹妹吃饭的图片视屏，作为很是嚣张，其他人已经有了好好揍他一顿的冲动了。
en_us: Everyone in the family chat group saw the photos and videos of Ye Feng and Ye Li having lunch, which were sent by Ye Feng. He seemed extremely arrogant and everyone else felt an urge to beat him up.

source: 容是没整，被家里人拦住了。
en_us: However, she did not end up going under the knife because she was stopped by her family.

source: 寂静的房间中，隐约听到了女人微弱的呼吸声。
en_us: In the quiet room, the faint sounds of a woman breathing faintly could be heard.

source: 对了，若非三哥突然出事，那影帝之位恐是永远也轮不到他吧！
en_us: 'Right, unless Third Brother suddenly encounters mishap, the title of the Best Actor will never, ever go to him!'

source: 对于叶漓的印象，还存在于曾今那个不怎么抬头，胆子也不大的女孩子身上。
en_us: Their impression of Ye Li was that she was a timid girl who dared not hold her head up high.

source: 对于她这种重口味的人来说，她是最讨厌吃这些味道奇怪的营养餐的。
en_us: Having always had a preference for flavorful food, she absolutely detested eating strange-tasting nutritious meals.

source: 对于自家小妹不愿意同徐家定亲还想不开自杀一事，三个男人都十分的愤怒。
en_us: The three men were furious that their little sister had tried to take her own life because she was unwilling to accept her marriage with the Xu Family.

source: 对于这样的行为，她是深通恶绝，十分反感。
en_us: She was extremely disgusted with Ye Li's behavior.

source: 对于这种不好好学习，一心只想着谈恋爱，名声又不好的学生，程艳是一点都不喜欢。
en_us: Cheng Yan did not like students like her who had poor grades and reputation, and were only obsessed with falling in love.

source: 对待几位哥哥，她脸上的冰冷和漠然全在一瞬间消失殆尽。
en_us: The coldness and indifference on her face vanished immediately after she saw her brothers.

source: 对方唇角带着笑，一副网瘾少年的表情，似乎注意到了他的目光，这才看过来，问：“你刚刚说什么来着？”
en_us: Ye Feng smiled and he looked just like a teenager who was addicted to the Internet. Seemingly having noticed his gaze, he looked over and asked, "What were you just saying?"

source: 对自己影响就算了，可一旦这些人将目光落到了阿漓身上，对她进行网络暴力，那自己可不就罪过了吗？
en_us: He wouldn't mind if he was the only one getting affected. However, now that everyone was focusing on Ye Li and bullying her on the Internet, he was at fault.

source: 寻了个角度，她拍摄了一组照片，并发上微博，配了一句：“裙子很漂亮。”
en_us: After finding the right angle, she took a set of photos and posted them on Twitter with the caption, "What a beautiful gown."

source: 导师笑着回应了一声：“小眉啊，等会将论文收一下，上课交给我。”
en_us: The teacher answered smilingly, "Ye Mei, please collect the thesis papers later and hand them to me in class."

source: 将这一幕看在眼里的叶眉，暗暗咬了咬牙。
en_us: Ye Mei, who had seen everything, gritted her teeth secretly.

source: 小公举梦梦：“你根本就配不上我们枫神...”
en_us: Little Princess Dreamy: "You're not worthy of our idol Ye Feng at all."

source: 小白兔回复真爱永恒：“我就是帝都大学的，我是风向cp粉，咱们里应外合，一定弄死这狐狸精！”
en_us: Replying to Eternal True Love, Little White Rabbit: "I'm from Beijing University and I ship Ye Feng with Xiangyant too. Let's cooperate to get rid of this vixen!"

source: 小胖好奇怪，今儿个给人的感觉全变了。
en_us: 'Little fatty seems so strange, she gives of a completely different vibe today.'

source: 少年皱眉回头看去，看见了叶眉。
en_us: The young man frowned and looked over, only to see Ye Mei.

source: 就听程艳不悦的问：“你的论文呢？怎么没交？”
en_us: Cheng Yan questioned in displeasure, "Where's your paper? Why didn't you submit it?"

source: 就在他绝望的档口，又听叶漓说话了，“不过原谅也不是不可能，毕竟咱们也是同学，我也不想闹的太难看。”
en_us: Just as he was feeling hopeless, he heard Ye Li speak again. "It's not impossible to forgive you. After all, we're classmates too and I don't want things to get too out of hand."

source: 就在这个时候，周围响起了一阵惊呼声。
en_us: At this moment, everyone exclaimed in shock.

source: 就在这紧张忐忑且难熬的等待中，“叮咚”一声突然就在寂静的会议室中响起，接着，接二连三的声音陆续响了起来。
en_us: In the midst of this nerve-wrecking and unbearable wait, a sudden 'Ding-dong' sounded in the conference room, followed by a series of other sounds.

source: 就怕如同那个叶漓所说，叶眉是偷了她的邀请函过来的，在这么多人的眼下，要是真闹出了这样的事情，那她们两个，也没脸见人了！
en_us: They were scared that Ye Mei had really stolen the invitation card to go to the gathering. If that were to be exposed in front of so many people, they would be utterly embarrassed!

source: 就是不知道，自家大哥知不知道他的未婚妻喜欢别人这件事。
en_us: However, she did not know if Xu Fengnian knew that his fiancée fancied someone else.

source: 就是他这个在娱乐圈见惯了美人的人，这会儿也难抑制的惊艳。
en_us: Even though he was used to seeing beautiful girls in the entertainment industry, he still couldn't suppress his amazement at the moment.

source: 就是因为老人在意门面，而她又在娱乐圈，难免会传出一些不好听的绯闻。
en_us: It was all because her in-laws were concerned about their reputation and if she continued to stay in the entertainment industry, she would inevitably be involved in some unpleasant scandals.

source: 就是因为自己不是正室所生，所以他才不愿意和自己接触。
en_us: 'He doesn't want to be around me because my mother is not the lawful wife.'

source: 就是太相信你的眼光了，以至于我上辈子丑了半辈子。
en_us: 'I spent my previous life being ugly because I trusted your taste too much.'

source: 就是奇怪，这位大小姐之前对他们总裁爱答不理，一副讨厌的模样，怎么今儿个倒是这么乖巧了？
en_us: 'Strange, Miss Ye has always been aloof and unfriendly to the CEO, and she often looks like she hates him. Why is she so obedient today?'

source: 就看见了这一幕，女孩坐在桌前，从他这个角度，正好看见小丫头晃动的脚丫。
en_us: As soon as he did, he saw her seated in front of the desk and from that angle, he happened to see her shaking her leg.

source: 就算是她道歉了又如何，道歉了，粉丝们就会买单吗？
en_us: Even if she apologized, so what? Would his fans buy it?

source: 就算是搭不上关系，出去随口炫耀说自己和他们在一个系，那也要被外人羡慕死。
en_us: Even if they could not get close to him, they could still go round showing off and saying that they were from the same faculty as him, so as to leave others green with envy.

source: 就算是自己捡点他漏下的，也比圈子里那些明星的混得好。
en_us: Even if he had to be in his shadow, he would do much better than the other celebrities of the entertainment industry.

source: 就见大家让开了一条道，叶眉正往自己的方向走了过来。
en_us: She saw that everyone had parted to make way for Ye Mei who was walking towards her.

source: 就连他走过去，也没有丝毫注意半分。
en_us: Even when he walked over, she didn't play the slightest attention to him at all.

source: 就连她叶漓，不也对叶眉好的不得了？
en_us: Even Ye Li had been very nice to Ye Mei.

source: 就连那个原本恼怒的粉丝听叶漓的话之后，也有些怀疑了起了事情的真实性，特别是叶眉自己也不敢肯定了的时候，她突然就觉得自己好像是真的误会了人家，刚刚还放话威胁别人，自己成了恶人。
en_us: Even the fan who was originally infuriated with Ye Li, began to doubt the authenticity of the matter after hearing Ye Li's words, especially since Ye Li dared not confirm it too. At that moment, she suddenly felt that she had really misunderstood Ye Li and that she was a villain for threatening Ye Li just now.

source: 已经过了八年，很多事情她都记不清了。
en_us: Eight years had passed, and she couldn't quite remember many of the events.

source: 已经过来陪老人吃了饭，他也没有继续待下去的必要了。
en_us: After having had a meal with the old patriarch, he saw no need in staying longer.

source: 帅气的人走到哪里都受欢迎，更别说这人还是他们学校男神榜排名第三的人。
en_us: Handsome guys would definitely attract attention and be popular wherever they go, not to mention, he ranked in third place on the School Beau rankings.

source: 帝都中心繁星庄园。
en_us: In Starry Manor in Beijing.

source: 帝都大学全国排No.1，里面有着世界各地的学生，美女帅哥如云，所以即使是叶眉这样已经十分漂亮的存在，顶多也就只能算是个系花而已。
en_us: Beijing University was the top university in the country and its students came from all over the world, many of whom were extremely good-looking. Hence, even a gorgeous girl like Ye Mei could only be considered the school belle of her faculty.

source: 帝都最中心最为豪华的地段，一座屹立中心的豪华庄园门口，路灯依次亮起，明黄色的灯光照耀着一辆辆缓缓开进的豪车。
en_us: In the most luxurious area of the city center, a large fleet of luxury cars were slowly driving into an opulent manor under the yellow light of the street lamps.

source: 常年被头发遮挡的肌肤，在阳光的映照下，几乎白的透明，刘海下若隐若现的眉毛，下面是那双摄人心魄的灵动双眼，圆润的脸也挡不住的精致五官。
en_us: Her skin, which used to be covered by her hair all the time, was almost translucently fair under the sunlight and her eyebrows were vaguely revealed beneath her bangs. Her soulful eyes were enchanting and the chubbiness of her face could not hide the beauty of her exquisite features.

source: 平时他们回来，这丫头都是闭门不见，或者装作没看见，今儿个倒是稀奇的很。
en_us: Whenever they returned, Ye Li would ignore them or pretend not to see them. The way she reacted today was rather rare and surprising.

source: 平时他们工作都很忙，大哥跟着父亲忙碌着庞大的公司，二哥是教授，经常会被邀请全国各地讲课。
en_us: They were usually busy with work. Her eldest brother was busy with managing the huge company with their father while her second brother, who was a professor, was often invited to give lectures all over the country.

source: 平时光是吃营养餐，她都还要备用一堆零食才能吃饱，叶眉不信叶漓能够瘦下去，所以并没有将她的这番话放心上。
en_us: Usually, Ye Li would have to eat a bunch of snacks after eating the nutritious meal in order to feel satiated. Ye Li did not believe that Ye Li could lose weight. Hence, she did not take her words to heart.

source: 平时叶漓最讨厌的就是自己的大脸，每次出门都恨不得用头发全部挡住，今儿个露出来了不说，竟然还觉得好看？
en_us: Ye Li's large face was what she usually hated the most and whenever she went out, she would be eager to cover her entire face with her hair. Yet, she revealed it today and even said that she looked great.

source: 平时叶眉看起来聪聪明明的，这点道理她不应该不懂才是。
en_us: Ye Mei usually seemed rather intelligent and she ought to have understood that logic.

source: 平时因为名声差的原因，也没人跟她玩，这些男同学更不会去关注一个土里土气的丑八怪了。
en_us: Usually, no one would hang out with Ye Li because of her bad reputation and the boys obviously wouldn't pay attention to a tacky and ugly girl.

source: 平时她不是跟自己关系最好了？
en_us: 'Isn't she the chummiest with me?'

source: 平时来叶家，谁对他不是热情有加。
en_us: Usually, everyone in the Ye Family would be extremely enthusiastic and friendly towards him.

source: 平时还有不少女的找上门，说是要打她。
en_us: There would be plenty of girls looking for her and claiming that they wanted to hit her.

source: 平时都是被叶漓骂了，然后阴沉着一张脸离开，可这次脸色虽然也难看，但好像是因为其他什么事情。
en_us: Usually, they would leave with sullen expressions after being berated by Ye Li. However, this time, they seemed to be sullen because of something else.

source: 并不是一时冲动或者怄气。
en_us: She did not do it out of spite or impulsiveness.

source: 并不是再跟自己开玩笑。
en_us: 'She's not joking with me.'

source: 并且引起了这么大的骚动，这不仅不合他们店铺规矩不说，而且闹大了还会影响店铺名誉，以及买家流失。
en_us: It even caused a huge uproar. Not only was it not in line with their brand policy, it also affected their reputation and would potentially cause a loss in buyers.

source: 并没有告诉叶漓，说是去参加的徐家聚会。
en_us: She did not inform Ye Li that she would be attending the Xu Family's gathering.

source: 幸福来得太快，让徐凤年有些恍惚，感觉不真实。
en_us: The quick arrival of bliss made Xu Fengnian feel a little dazed as he found it all too surreal.

source: 当今影后白梦的经纪人就是他。
en_us: He was the manager of Bai Meng, the current Best Actress titleholder.

source: 当初叶眉上了女神榜的时候，很多人都去关注了她，自然而然会去观察她的生活，之后听说哈她还有个姐姐在同一个班级之后，大家都对叶漓产生了好奇，不少人慕名去找，结果没想到，竟然还是个又矮又胖，一眼看去只能看到头发女孩子。
en_us: When Ye Mei was first listed on the goddess rankings, a lot of people started paying attention to her and her life. Later on, they found out that she had an older sister who was in the same class as her and thus, began to get curious about Ye Li. Many people tried to find out more about you but to their surprise, she was actually a short and chubby girl who had her face covered by her hair.

source: 当初母亲为了嫁入徐家，不惜放弃了自己正值巅峰时期的职业。
en_us: Back then, for the sake of marrying into the Xu Family, Kong Yun willingly gave up her career when she was at the pinnacle.

source: 当初还因此，他们班的人出去没少被其他班级学生嘲笑过。
en_us: Back then, the people from their class were often ridiculed by the students of other classes.

source: 当初还被不少同学看到，自此之后，大家一度猜测，她是不是被谁包养。
en_us: Back then, many of their classmates saw it too and ever since then, everyone guessed that she was a kept mistress.

source: 当听到妹妹被他欺负的时候，他就已经决定要彻底断绝两人的兄弟关系。
en_us: When he heard his younger sister getting bullied, he had already decided to completely sever his ties with Yu Xiangyang.

source: 当天晚上。
en_us: On the same night, Ye Feng who had been staying silent about the scandal, finally posted a statement on Twitter.

source: 当年叶漓出生的时候，可是惊动了整个帝都的。
en_us: Back then, Ye Li's birth had caused a huge uproar in the entire Beijing.

source: 当时她就一直想着打这张卡的注意了。
en_us: At that time, she had been coveting that card.

source: 当有一天，你所有引以为豪的都被人超过取代时，你又会是什么样的表情，肯定很精彩吧？
en_us: 'It must be wonderful to see what you look like when everything you are proud of gets taken away from you by someone who surpasses you and replaces you, right?'

source: 当然，做自家老公身边这种事可一点也不勉强。
en_us: Of course, she did not feel forced to sit beside her husband at all.

source: 当然，后面死的也很惨。
en_us: Of course, she died a horrible death later.

source: 当然，学校的大明星除了于向阳还有一个枫神。
en_us: Of course, in addition to Yu Xiangyang, there was another celebrity in school, Ye Feng.

source: 当然，这种事情叶眉肯定不会告诉叶漓，也不会让她有结交这些人的机会。
en_us: Of course, Ye Mei definitely wouldn't tell Ye Li about it or even give her the chance to get close to those people.

source: 很快到了家。
en_us: Soon, they arrived at home.

source: 很是文艺的名字，她的微博分享的也都是十分漂亮的图片或者是日常vlog，每一条微博的转发点赞都是好多万。
en_us: It was a very literary name and she often shared beautiful photos or vlogs of her daily life on her Twitter account. Each tweet of hers would garner tens of thousands of 'likes' and 'retweets'.

source: 很显然，她不喜欢这个叶眉。
en_us: Clearly, she disliked Ye Mei.

source: 很显然，现在的叶漓在他们看来就是这样的人。
en_us: Clearly, they thought that Ye Li was one of those type of women.

source: 徐倩也是格外惊讶的看着叶漓，随后对着自家哥哥不满的说：“她看起来不像是那样的女孩啊，怎么会这么花心啊，太过分了吧，大哥那样的人，怎么可能接受的了这样的事？”
en_us: Xu Qian looked at Ye Li in shock, after which she said to her brother in displeasure, "She doesn't seem to be that kind of girl either. Why is she such a philanderer? How can our eldest cousin accept such a thing?"

source: 徐倩想来想去也想不通，这会儿大脑都是嗡嗡嗡的。
en_us: Xu Qian couldn't figure it out at all and her head was buzzing after pondering over it for a while.

source: 徐倩有些不好意思的看着她，其实她也不知道国内大学的要求多高，只是听说自家哥哥在那个学校就想去了。
en_us: Xu Qian looked at her somewhat embarrassedly. In fact, she did not know exactly how high the admission requirements for local colleges were. She simply wanted to go to Beijing University because it was the school that her brother was in.

source: 徐倩走出来看到这一幕，十分惊讶的凑过来说：“哥，咋回事啊？”
en_us: When Xu Qian walked out and saw that, she approached him in astonishment and asked, "Brother, what's the matter?"

source: 徐倩赶忙凑了过去，“姐姐，怎么了？”
en_us: Xu Qian hurriedly leaned over and asked, "Sister, what's the matter?"

source: 徐倩跟徐晗长得有几分相似，看起来十分娇小可爱，再加上又坐在徐晗的身边，叶漓猜测应该是徐晗的妹妹。
en_us: Xu Qian looked a little similar to Xu Han, and was rather adorable and delicate-looking. Besides, she was seated beside Xu Han. Ye Li guessed that she was Xu Han's younger sister.

source: 徐凤年一顿，脸色缓和了不少，点了点头。
en_us: Xu Fengnian paused and his expression eased up a little as he nodded.

source: 徐凤年一顿，随后哭笑不得。
en_us: Xu Fengnian paused, caught between laughter and tears.

source: 徐凤年仔细看了一会，见只是有些红，稍稍松了口气，“没事，缓一会就好了。”
en_us: After observing for a while and seeing that it had only turned a little red, he heaved a sigh of relief and said, "It's alright, you will be fine after a while."

source: 徐凤年冷峻的脸一沉。
en_us: Xu Fengnian's cold face turned sullen.

source: 徐凤年听着女孩委委屈屈的声音，心里更是冒火。
en_us: Xu Fengnian was even more enraged after hearing her pitiful voice.

source: 徐凤年和叶洛几人都沉了脸。
en_us: The expressions of Xu Fengnian, Ye Luo, and the others became sullen.

source: 徐凤年头也未抬，丢出了几个字：“御食坊。”
en_us: Without even looking up, Xu Fengnian answered, "Imperial Restaurant."

source: 徐凤年抿了抿唇，眼神复杂的看向身旁坐着的叶漓。
en_us: Xu Fengnian pused his lips and looked at Ye Li who was beside him, with a complicated gaze.

source: 徐凤年拉开车门，一手护着她的头让她先上了车。
en_us: Xu Fengnian opened the car door and allowed her to get inside the car while placing his hand above her head so that she would not hit her head against the top of the car.

source: 徐凤年掀了掀眼皮，眼神很冷，“阿漓和她哥哥吃个饭，有什么好解决的？”
en_us: Xu Fengnian looked up with a hostile gaze and said, "Ye Li was just having a meal with her elder brother, what's there to settle?"

source: 徐凤年接过，插了一块放到了叶漓在嘴边，“阿漓，吃水果。”
en_us: Xu Fengnian grabbed it, poked his fork into a piece of fruit, and placed it beside Ye Li's lips. "Li, have some fruit."

source: 徐凤年斜眸看着女孩。
en_us: Xu Fengnian looked at her from sideways.

source: 徐凤年是这一代的继承人，如今的集团总裁，他父亲早逝，所以代替了父亲的位置。
en_us: Xu Fengnian was the successor of his generation and was currently holding the position of the CEO of the family's corporation on behalf of his father who had passed away young.

source: 徐凤年本来想把人放一旁坐下，谁料小丫头的手抱得紧紧的，死死不松。
en_us: Xu Fengnian initially wanted to put her down by the side but to his surprise, she hugged him tightly adn refused to let go.

source: 徐凤年本来郁闷的心情，突然烟消云散。
en_us: Xu Fengnian's gloomy feeling suddenly vanished.

source: 徐凤年歪头看了她一眼，小丫头看自己眼神中的不悦都快溢出来了。
en_us: Xu Fengnian tilted his head to look at her, only to see that the displeasure in her eyes were about to overflow.

source: 徐凤年没有看她，反倒是看向叶漓，仿佛在等她挽留。
en_us: Xu Fengnian did not look at her. Instead, he looked at Ye Li, seemingly waiting for her to hold her back.

source: 徐凤年淡淡的将叶枫和叶漓吃饭一事随口一说。
en_us: Xu Fengnian calmly explained the matter about Ye Feng having lunch with Ye Li.

source: 徐凤年漠然的点了点头，“我未婚妻，阿漓。”
en_us: Xu Fengnian nodded indifferently and said, "She's Ye Li, my fiancée."

source: 徐凤年点了点头。
en_us: Xu Fengnian nodded.

source: 徐凤年的心里是有些震惊的。
en_us: Xu Fengnian was rather astonished.

source: 徐凤年的手一僵。
en_us: Xu Fengnian's hand stiffened.

source: 徐凤年的脸色逐渐阴沉了下去：“叶漓，你知道你再说什么吗？”
en_us: Xu Fengnian's face gradually turned gloomy and austere. "Ye Li, do you know what you're saying?"

source: 徐凤年的表情一僵，“你说什么？”
en_us: Xu Fengnian's expression stiffened and he asked, "What did you say?"

source: 徐凤年的表情因为叶漓的动作扭曲了一下，可见她疼的眼泪汪汪，也来不及顾及，担心的道：“给我看看。”
en_us: Xu Fengnian's expression stiffened for a while because of Ye Li's movement, and seeing that her eyes were tearing up with pain, he couldn't care less and asked worriedly, "Let me see it."

source: 徐凤年直接将她送回了家。
en_us: Xu Fengnian sent her home immediately.

source: 徐凤年眉头蹙的更深了：“想找工作你可以去公司面试，那有专门的负责招聘的工作人员。”
en_us: Xu Fengnian's frown became deeper and he said, "If you want a job, go to the office for an interview, there are professional staff who are in charge of recruitment."

source: 徐凤年看去，她的头发确实有些乱，想着自家从小就当做宝贝宠着的小丫头，在外面竟然别人这般欺负，他的眉眼又是一寒，“我给你报仇。”
en_us: Xu Fengnian looked over to see that her hair was indeed messy. Thinking about the fact that the precious girl whom he had been pampering and spoiling to bits ever since she was a child, actually got bullied by others, his eyes turned cold and he said, "I'll take revenge for you."
